tests/support/data/syntheticPaymentData.json

{
  "QR": {
    "ARS_ARS": {
      "userAnyId": "100009359",
      "paymentDestination": "qr3manualamount",
      "amount": "1000",
      "against": "ARS"
    },
    "USDT_ARS": {
      "userAnyId": "100009359",
      "paymentDestination": "qr3manualamount",
      "amount": "1000",
      "against": "USDT"
    },
    "USDC_ARS": {
      "userAnyId": "100009359",
      "paymentDestination": "qr3manualamount",
      "amount": "1000",
      "against": "USDC"
    },
    "BRL_ARS": {
      "userAnyId": "100011657",
      "paymentDestination": "qr3manualamount",
      "amount": "1000",
      "against": "BRL"
    }
  },
  "PIX": {
    "ARS_BRL": {
      "userAnyId": "100009359",
      "paymentDestination": "pixmanualamount",
      "amount": "10",
      "against": "ARS"
    },
    "USDT_BRL": {
      "userAnyId": "100009359",
      "paymentDestination": "pixmanualamount",
      "amount": "10",
      "against": "USDT"
    },
    "BRL_BRL": {
      "userAnyId": "100011657",
      "paymentDestination": "00020126480014BR.GOV.BCB.PIX0126leandro.ribeiro@meujota.ai520400005303986540550.005802BR5925LEANDRO DE OLIVEIRA NOEL 6009SAO PAULO622905255b9f00c0931f47dd89e207276630474E8",
      "amount": "10",
      "against": "BRL"
    }
  },
  "PIXKEY": {
    "ARS_BRL": {
      "userAnyId": "100009359",
      "paymentDestination": "+5511949227612",
      "amount": "10",
      "against": "ARS"
    },
    "USDT_BRL": {
      "userAnyId": "100009359",
      "paymentDestination": "+5511949227612",
      "amount": "10",
      "against": "USDT"
    },
    "BRL_ARS": {
      "userAnyId": "100009359",
      "paymentDestination": "+5511949227612",
      "amount": "10",
      "against": "BRL"
    }
  },
  "FAILURE": {
    "ARS_ARS": {
      "userAnyId": "100009359",
      "paymentDestination": "qr3manualamountfailure",
      "amount": "1000",
      "against": "ARS"
    }
  },
  "REFUND": {
    "ARS_ARS": {
      "userAnyId": "100009359",
      "paymentDestination": "qr3manualamountrefund",
      "amount": "1000",
      "against": "ARS"
    }
  }
}
